In [1]:
import numpy as np
import pandas as pd

In [2]:
a = [i for i in range(5)]
a

[0, 1, 2, 3, 4]

In [3]:
b = pd.Series(a)
b

0    0
1    1
2    2
3    3
4    4
dtype: int64

### Можно задать индексы

In [4]:
b = pd.Series(a, index=['a','b','c','d','f'])
b

a    0
b    1
c    2
d    3
f    4
dtype: int64

In [5]:
from datetime import date

In [6]:
ind = [date(y,m,d) for y,m,d in [(2021,5,12),(2021,6,15),(2021,7,18),(2021,10,24),(2021,4,11)]]

In [7]:
b = pd.Series(a, index=ind)
b

2021-05-12    0
2021-06-15    1
2021-07-18    2
2021-10-24    3
2021-04-11    4
dtype: int64

In [8]:
b.index

Index([2021-05-12, 2021-06-15, 2021-07-18, 2021-10-24, 2021-04-11], dtype='object')

In [9]:
b.index[0].month

5

In [10]:
b.index[0].year

2021

In [11]:
b.index[0].day

12

### Переводим дату в формат datetime64

In [12]:
b.index = pd.to_datetime(b.index, format='%Y-%m-%d')

In [13]:
b.index

DatetimeIndex(['2021-05-12', '2021-06-15', '2021-07-18', '2021-10-24',
               '2021-04-11'],
              dtype='datetime64[ns]', freq=None)

In [14]:
b.index.year

Int64Index([2021, 2021, 2021, 2021, 2021], dtype='int64')

In [15]:
b.index.month

Int64Index([5, 6, 7, 10, 4], dtype='int64')

In [16]:
b.index.day

Int64Index([12, 15, 18, 24, 11], dtype='int64')

Индексы могут повторяться и их можно менять

In [17]:
b.index = [10,11,1,1,15]

In [18]:
b.index

Int64Index([10, 11, 1, 1, 15], dtype='int64')

### Задать тип данных

In [19]:
b = pd.Series(a, dtype=np.float64)
b

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

### Или поменять тип данных

In [20]:
b = pd.Series(a)
b = b.astype(np.float64)
b

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

### Можно создать Series из словаря

In [21]:
d = {'1':2,'2':55,'llkj':88}

In [22]:
b = pd.Series(d)
b

1        2
2       55
llkj    88
dtype: int64

### Посмтреть данные в виде Numpy

In [23]:
b.values

array([ 2, 55, 88], dtype=int64)

### Доступ по индексу

In [24]:
b['llkj']

88

In [25]:
b[['llkj','1']]

llkj    88
1        2
dtype: int64

In [26]:
b.head()

1        2
2       55
llkj    88
dtype: int64

In [27]:
b.tail()

1        2
2       55
llkj    88
dtype: int64

### Выборка

In [28]:
a = np.random.randint(10,50,20)
b = pd.Series(a)
b

0     33
1     43
2     37
3     36
4     44
5     34
6     36
7     27
8     26
9     41
10    39
11    33
12    28
13    41
14    13
15    33
16    10
17    17
18    48
19    45
dtype: int32

In [29]:
b[b>20]

0     33
1     43
2     37
3     36
4     44
5     34
6     36
7     27
8     26
9     41
10    39
11    33
12    28
13    41
15    33
18    48
19    45
dtype: int32

In [30]:
b[(b>20) & (b%2 == 0)]

3     36
4     44
5     34
6     36
8     26
12    28
18    48
dtype: int32

### Изменение эллементов Series

In [31]:
b[0]=4
b

0      4
1     43
2     37
3     36
4     44
5     34
6     36
7     27
8     26
9     41
10    39
11    33
12    28
13    41
14    13
15    33
16    10
17    17
18    48
19    45
dtype: int32

In [32]:
b[b>20] = 1
b

0      4
1      1
2      1
3      1
4      1
5      1
6      1
7      1
8      1
9      1
10     1
11     1
12     1
13     1
14    13
15     1
16    10
17    17
18     1
19     1
dtype: int32

In [33]:
b[0,1,5] = 11
b

0     11
1     11
2      1
3      1
4      1
5     11
6      1
7      1
8      1
9      1
10     1
11     1
12     1
13     1
14    13
15     1
16    10
17    17
18     1
19     1
dtype: int32

### Добавление данных

In [34]:
a = np.random.randint(10,50,20)
b = pd.Series(a)
b

0     10
1     10
2     28
3     27
4     25
5     28
6     10
7     11
8     25
9     26
10    48
11    45
12    33
13    35
14    32
15    43
16    32
17    43
18    32
19    40
dtype: int32

In [35]:
b = b.append(pd.Series({45:12,59:34}))
b

0     10
1     10
2     28
3     27
4     25
5     28
6     10
7     11
8     25
9     26
10    48
11    45
12    33
13    35
14    32
15    43
16    32
17    43
18    32
19    40
45    12
59    34
dtype: int64

### Удаление данных по индексу

In [36]:
b = b.drop([0,2,4])
b

1     10
3     27
5     28
6     10
7     11
8     25
9     26
10    48
11    45
12    33
13    35
14    32
15    43
16    32
17    43
18    32
19    40
45    12
59    34
dtype: int64

### Сохранение и чтение Series в файл

In [37]:
b.to_pickle('b.pkl')

In [38]:
b2 = pd.read_pickle('b.pkl')

In [39]:
b2

1     10
3     27
5     28
6     10
7     11
8     25
9     26
10    48
11    45
12    33
13    35
14    32
15    43
16    32
17    43
18    32
19    40
45    12
59    34
dtype: int64

# DATAFRAME

In [40]:
df = pd.DataFrame({'Col_1':['a','s','d','f','e'],
                  'Col_2':[1,2,3,4,5]}, columns = ['Col_1','Col_2'])
df

  Col_1  Col_2
0     a      1
1     s      2
2     d      3
3     f      4
4     e      5

### Просмотр информации о DataFrame

In [41]:
df.shape

(5, 2)

In [42]:
df.columns

Index(['Col_1', 'Col_2'], dtype='object')

In [43]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col_1   5 non-null      object
 1   Col_2   5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [45]:
df.describe()

          Col_2
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000

In [46]:
df.head(3)

  Col_1  Col_2
0     a      1
1     s      2
2     d      3

In [47]:
df.tail(3)

  Col_1  Col_2
2     d      3
3     f      4
4     e      5

In [48]:
df['Col_1'].head()

0    a
1    s
2    d
3    f
4    e
Name: Col_1, dtype: object

In [49]:
df.Col_1.head()

0    a
1    s
2    d
3    f
4    e
Name: Col_1, dtype: object

### Изменение индекса

In [50]:
df.index =[5,6,7,8,9]
df

  Col_1  Col_2
5     a      1
6     s      2
7     d      3
8     f      4
9     e      5

### Выбор данных по индексу

In [51]:
df.loc[7,'Col_1']

'd'

In [52]:
df.loc[7,:]

Col_1    d
Col_2    3
Name: 7, dtype: object

In [53]:
df.loc[6:8,:]

  Col_1  Col_2
6     s      2
7     d      3
8     f      4

### Выбор данных по позиции

In [54]:
df

  Col_1  Col_2
5     a      1
6     s      2
7     d      3
8     f      4
9     e      5

In [55]:
df.iloc[0,:]

Col_1    a
Col_2    1
Name: 5, dtype: object

In [56]:
df.iloc[0:2,:]

  Col_1  Col_2
5     a      1
6     s      2

In [57]:
df.iloc[0:2,0]

5    a
6    s
Name: Col_1, dtype: object

### Выбор по условию

In [58]:
df.loc[df['Col_1'] == 'd',:]

  Col_1  Col_2
7     d      3

In [59]:
df.loc[df['Col_1']== 'd','Col_2']

7    3
Name: Col_2, dtype: int64

In [60]:
df.loc[df['Col_1']== 'd','Col_2'].values

array([3], dtype=int64)

In [61]:
df.loc[df['Col_2'] > 2, 'Col_1']

7    d
8    f
9    e
Name: Col_1, dtype: object

In [62]:
df.loc[(df['Col_1'] != 'f') & (df['Col_2'] >2),:]

  Col_1  Col_2
7     d      3
9     e      5

In [63]:
# Вывести отрезок
df.loc[df['Col_2'].between(2,4), :]

  Col_1  Col_2
6     s      2
7     d      3
8     f      4

In [64]:
# Вывести конкретные эллементы
df.loc[df['Col_1'].isin(['s','f']),:]

  Col_1  Col_2
6     s      2
8     f      4

In [65]:
# НЕ ВЫВОДИТЬ конкретные эллементы
df.loc[~df['Col_1'].isin(['s','f']),:]

  Col_1  Col_2
5     a      1
7     d      3
9     e      5

### Метод query

In [66]:
df.query("Col_1 == 's'")

  Col_1  Col_2
6     s      2

In [67]:
df.query("Col_2 > 2")

  Col_1  Col_2
7     d      3
8     f      4
9     e      5

### Столбец DataFrame

In [68]:
s = df['Col_1']

In [69]:
type(s)

pandas.core.series.Series

### Получение DataFrame из Series

In [70]:
df2 = pd.DataFrame(s)
df2

  Col_1
5     a
6     s
7     d
8     f
9     e

### Копирование DataFrame

In [71]:
df3 = df.copy()
df3

  Col_1  Col_2
5     a      1
6     s      2
7     d      3
8     f      4
9     e      5

## Случайная выборка из DataFrame

### Случайная выборка n-строк

In [72]:
df.sample(n=2)

  Col_1  Col_2
9     e      5
8     f      4

### Случайная выборка доли от фрейма

In [73]:
df.sample(frac=0.5)

  Col_1  Col_2
7     d      3
6     s      2

### Случайный выбор
replace=True - строки могут повторяться

In [74]:
df.sample(frac=0.7, replace=True)

  Col_1  Col_2
9     e      5
8     f      4
6     s      2
8     f      4

### Случайное перемешивание

In [75]:
df.sample(frac=1, random_state=42)

  Col_1  Col_2
6     s      2
9     e      5
7     d      3
5     a      1
8     f      4

## Чтение и запись DataFrame в csv

In [76]:
df.to_csv('Test.csv', sep=';', index=False)

In [77]:
df_new = pd.read_csv('Test.csv',sep=';')

In [78]:
df_new

  Col_1  Col_2
0     a      1
1     s      2
2     d      3
3     f      4
4     e      5

## Слияние данных

In [79]:
authors = pd.DataFrame({'author_id':[1,2,3], 'author_name':['Pushkin','Tolstoy','Dostoevsky']},
                      columns=['author_id','author_name'])
authors

   author_id author_name
0          1     Pushkin
1          2     Tolstoy
2          3  Dostoevsky

In [80]:
books = pd.DataFrame({'author_id':[2,3,3,4], 'book_title':['War and Peace','The Idiot','Crime and Punishment',
                                                           'Fathers and Sons']})
books

   author_id            book_title
0          2         War and Peace
1          3             The Idiot
2          3  Crime and Punishment
3          4      Fathers and Sons

### MERGE

In [81]:
df1 = pd.merge(authors, books, on ='author_id', how ='inner')
df1

   author_id author_name            book_title
0          2     Tolstoy         War and Peace
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  Crime and Punishment

In [82]:
df2 = pd.merge(authors, books, on ='author_id', how ='left')
df2

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment

In [83]:
df3 = pd.merge(authors, books, on ='author_id', how ='right')
df3

   author_id author_name            book_title
0          2     Tolstoy         War and Peace
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  Crime and Punishment
3          4         NaN      Fathers and Sons

In [84]:
df4 = pd.merge(authors, books, on ='author_id', how ='outer')
df4

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

### Работа с пропушенными данными

In [85]:
df4.loc[df4['book_title'].isnull(),:]

   author_id author_name book_title
0          1     Pushkin        NaN

In [86]:
df4.loc[df4['author_name'].notnull(),:]

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment

In [87]:
df4['book_title'] = df4['book_title'].fillna('unknow')
df4

   author_id author_name            book_title
0          1     Pushkin                unknow
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

In [88]:
df4['author_name'].fillna('unknow', inplace=True)
df4

   author_id author_name            book_title
0          1     Pushkin                unknow
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4      unknow      Fathers and Sons

### Добавление столбцов

In [89]:
df4.loc[(df4['author_name'] != 'unknow') &(df4['book_title'] != 'unknow'), 'quantity'] = 1
df4

   author_id author_name            book_title  quantity
0          1     Pushkin                unknow       NaN
1          2     Tolstoy         War and Peace       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  Crime and Punishment       1.0
4          4      unknow      Fathers and Sons       NaN

In [90]:
df4['quantity'].fillna(0, inplace=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin                unknow       0.0
1          2     Tolstoy         War and Peace       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  Crime and Punishment       1.0
4          4      unknow      Fathers and Sons       0.0

### Меняем тип столбца

In [91]:
df4['quantity'] = df4['quantity'].astype(int)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin                unknow         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4      unknow      Fathers and Sons         0

### Делаем столбец индексом

In [92]:
df4.set_index('author_id', inplace=True)
df4

          author_name            book_title  quantity
author_id
1             Pushkin                unknow         0
2             Tolstoy         War and Peace         1
3          Dostoevsky             The Idiot         1
3          Dostoevsky  Crime and Punishment         1
4              unknow      Fathers and Sons         0

In [93]:
# обратно
df4.reset_index(inplace=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin                unknow         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4      unknow      Fathers and Sons         0

## Удаление данных

In [94]:
df4['price']=500
df4

   author_id author_name            book_title  quantity  price
0          1     Pushkin                unknow         0    500
1          2     Tolstoy         War and Peace         1    500
2          3  Dostoevsky             The Idiot         1    500
3          3  Dostoevsky  Crime and Punishment         1    500
4          4      unknow      Fathers and Sons         0    500

In [95]:
# Удадляем столбец
df4 = df4.drop('price',axis=1)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin                unknow         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4      unknow      Fathers and Sons         0

In [96]:
# удаляем стороку по индексу
df4.drop(1,axis=0,inplace=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin                unknow         0
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4      unknow      Fathers and Sons         0

## Сортировка данных

In [97]:
df4 = df4.append(pd.DataFrame({'author_id':[2],
                              'author_name':['Tolstoy'],
                              'book_title':['War and Peace'],
                              'quantity':[1]},
                             columns=['author_id','author_name','book_title','quantity']),
                ignore_index=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin                unknow         0
1          3  Dostoevsky             The Idiot         1
2          3  Dostoevsky  Crime and Punishment         1
3          4      unknow      Fathers and Sons         0
4          2     Tolstoy         War and Peace         1

### Отсортируем по столбцу author_id

In [98]:
df4 = df4.sort_values('author_id')
df4

   author_id author_name            book_title  quantity
0          1     Pushkin                unknow         0
4          2     Tolstoy         War and Peace         1
1          3  Dostoevsky             The Idiot         1
2          3  Dostoevsky  Crime and Punishment         1
3          4      unknow      Fathers and Sons         0

### Переустановим индекс

In [99]:
df4 = df4.reset_index(drop=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin                unknow         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4      unknow      Fathers and Sons         0

## Соединение DataFrame

In [100]:
df5 = pd.DataFrame({'author_id':[3,5],
                   'author_name':['Dostoevsky','Chehov'],
                   'book_title':['Gameble','Three sistrs'],
                   'quantity':[1,1]},
                  columns=['author_id','author_name','book_title','quantity'])
df5

   author_id author_name    book_title  quantity
0          3  Dostoevsky       Gameble         1
1          5      Chehov  Three sistrs         1

In [101]:
# По строкам объединяем
df6 = pd.concat([df4,df5],axis=0,ignore_index=True)
df6

   author_id author_name            book_title  quantity
0          1     Pushkin                unknow         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4      unknow      Fathers and Sons         0
5          3  Dostoevsky               Gameble         1
6          5      Chehov          Three sistrs         1

In [102]:
# По столбцам объединяем
prices = pd.DataFrame({'price':[100,200,300,400,500]},columns=['price'], index= [1,2,3,5,6])
prices

   price
1    100
2    200
3    300
5    400
6    500

In [103]:
df7 = pd.concat([df6,prices],axis=1)
df7

   author_id author_name            book_title  quantity  price
0          1     Pushkin                unknow         0    NaN
1          2     Tolstoy         War and Peace         1  100.0
2          3  Dostoevsky             The Idiot         1  200.0
3          3  Dostoevsky  Crime and Punishment         1  300.0
4          4      unknow      Fathers and Sons         0    NaN
5          3  Dostoevsky               Gameble         1  400.0
6          5      Chehov          Three sistrs         1  500.0

## Применение функций и методов

In [104]:
df7['total']= df7['quantity']*df7['price']
df7

   author_id author_name            book_title  quantity  price  total
0          1     Pushkin                unknow         0    NaN    NaN
1          2     Tolstoy         War and Peace         1  100.0  100.0
2          3  Dostoevsky             The Idiot         1  200.0  200.0
3          3  Dostoevsky  Crime and Punishment         1  300.0  300.0
4          4      unknow      Fathers and Sons         0    NaN    NaN
5          3  Dostoevsky               Gameble         1  400.0  400.0
6          5      Chehov          Three sistrs         1  500.0  500.0

In [105]:
df7['price'].max()

500.0

In [106]:
df7['price'].min()

100.0

In [107]:
df7['price'].mean()

300.0

In [108]:
df7['price'].median()

300.0

In [109]:
df7['price'].std()

158.11388300841898

In [110]:
#дисперсия
df7['price'].var()

25000.0

In [111]:
df7.nlargest(3,'price')

   author_id author_name            book_title  quantity  price  total
6          5      Chehov          Three sistrs         1  500.0  500.0
5          3  Dostoevsky               Gameble         1  400.0  400.0
3          3  Dostoevsky  Crime and Punishment         1  300.0  300.0

In [112]:
df7['author_name'].unique()

array(['Pushkin', 'Tolstoy', 'Dostoevsky', 'unknow', 'Chehov'],
      dtype=object)

In [113]:
df7['author_name'].nunique()

5

In [114]:
df7['author_name'].value_counts()

Dostoevsky    3
Chehov        1
Pushkin       1
unknow        1
Tolstoy       1
Name: author_name, dtype: int64

## Построчное применение методов и функций

In [115]:
df7['book_title'] = df7['book_title'].apply(lambda x: x.upper())
df7

   author_id author_name            book_title  quantity  price  total
0          1     Pushkin                UNKNOW         0    NaN    NaN
1          2     Tolstoy         WAR AND PEACE         1  100.0  100.0
2          3  Dostoevsky             THE IDIOT         1  200.0  200.0
3          3  Dostoevsky  CRIME AND PUNISHMENT         1  300.0  300.0
4          4      unknow      FATHERS AND SONS         0    NaN    NaN
5          3  Dostoevsky               GAMEBLE         1  400.0  400.0
6          5      Chehov          THREE SISTRS         1  500.0  500.0

### Группировка данных

#### 1 способ

In [116]:
df7.groupby('author_name')['price'].max()

author_name
Chehov        500.0
Dostoevsky    400.0
Pushkin         NaN
Tolstoy       100.0
unknow          NaN
Name: price, dtype: float64

#### 2 способ

In [117]:
price_agg = df7.groupby('author_name').agg({'price':'max'})
price_agg

             price
author_name
Chehov       500.0
Dostoevsky   400.0
Pushkin        NaN
Tolstoy      100.0
unknow         NaN

In [118]:
price_agg = price_agg.reset_index()
price_agg

  author_name  price
0      Chehov  500.0
1  Dostoevsky  400.0
2     Pushkin    NaN
3     Tolstoy  100.0
4      unknow    NaN

In [119]:
price_agg = price_agg.rename(columns={'price':'max_price'})
price_agg

  author_name  max_price
0      Chehov      500.0
1  Dostoevsky      400.0
2     Pushkin        NaN
3     Tolstoy      100.0
4      unknow        NaN